In [22]:
import pandas as pd
import numpy as np

In [4]:
df = pd.read_csv("G:\math and stat\income2.csv", names=["name","income"], skiprows=[0])

In [5]:
df.head()

    name  income
0    Rob    5000
1  Rafiq    6000
2   Nina    4000
3  Sofia    7500
4  Mohan    8000

In [7]:
df.describe()

             income
count  7.000000e+00
mean   1.433929e+06
std    3.777283e+06
min    4.000000e+03
25%    5.500000e+03
50%    7.000000e+03
75%    7.750000e+03
max    1.000000e+07

In [9]:
df.income.quantile(0.25)

5500.0

In [10]:
df.income.quantile(0.50)

7000.0

In [11]:
df.income.quantile(0.75)

7750.0

In [12]:
df.income.quantile(0.25, interpolation='lower')

5000

In [13]:
df.income.quantile(0.25, interpolation='higher')

6000

In [14]:
df.income.quantile(0)

4000.0

In [15]:
df.income.quantile(1)

10000000.0

In [18]:
percentile_99 = df.income.quantile(0.99)
percentile_99

9400479.999999994

In [19]:
df_no_outliers = df[df.income<=percentile_99]
df_no_outliers

    name  income
0    Rob    5000
1  Rafiq    6000
2   Nina    4000
3  Sofia    7500
4  Mohan    8000
5    Tao    7000

In [20]:
df

        name    income
0        Rob      5000
1      Rafiq      6000
2       Nina      4000
3      Sofia      7500
4      Mohan      8000
5        Tao      7000
6  Elon Musk  10000000

In [23]:
df['income'][3] = np.NaN

C:\Users\Tanvir Ahmed\AppData\Local\Temp\ipykernel_8716\2943373670.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['income'][3] = np.NaN

In [24]:
df

        name      income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia         NaN
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0

In [25]:
df_new = df.fillna(df.income.mean())
df_new

        name        income
0        Rob  5.000000e+03
1      Rafiq  6.000000e+03
2       Nina  4.000000e+03
3      Sofia  1.671667e+06
4      Mohan  8.000000e+03
5        Tao  7.000000e+03
6  Elon Musk  1.000000e+07

In [26]:
df_new = df.fillna(df.income.median())
df_new

        name      income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia      6500.0
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0